
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 3 to change, 9 to destroy.</code></pre>

* Update
  * azurerm_resource_group.rg
  * module.ia_case_api_database_11.azurerm_resource_group.data-resourcegroup
  * module.ia_case_api_database_11.azurerm_template_deployment.postgres-paas
* Delete
  * azurerm_key_vault_secret.POSTGRES-PASS-15
  * module.ia-case-api-db-v15.azurerm_postgresql_flexible_server.pgsql_server
  * module.ia-case-api-db-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.ia-case-api-db-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.ia-case-api-db-v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
  * module.ia-case-api-db-v15.azurerm_postgresql_flexible_server_database.pg_databases[&#34;ia_case_api&#34;]
  * module.ia-case-api-db-v15.azurerm_resource_group.rg[0]
  * module.ia-case-api-db-v15.null_resource.set-user-permissions-additionaldbs[&#34;ia_case_api&#34;]
  * module.ia-case-api-db-v15.random_password.password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS-15 will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-PASS-15 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-PASS-15" {
      - content_type            = "" -> null
      - id                      = "https://ia-aat.vault.azure.net/secrets/case-api-POSTGRES-PASS-15/e38e4a1f0b574e90a6e87d8add172fbc" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-aat/providers/Microsoft.KeyVault/vaults/ia-aat" -> null
      - name                    = "case-api-POSTGRES-PASS-15" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-aat/providers/Microsoft.KeyVault/vaults/ia-aat/secrets/case-api-POSTGRES-PASS-15/versions/e38e4a1f0b574e90a6e87d8add172fbc" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-aat/providers/Microsoft.KeyVault/vaults/ia-aat/secrets/case-api-POSTGRES-PASS-15" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "e38e4a1f0b574e90a6e87d8add172fbc" -> null
      - versionless_id          = "https://ia-aat.vault.azure.net/secrets/case-api-POSTGRES-PASS-15" -> null
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-case-api-aat"
        name     = "ia-case-api-aat"
      ~ tags     = {
          - "application"         = "immigration"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/ia-case-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ia-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-12-19T11:30:59Z"
          - "managedBy"           = "Immigration"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.ia-case-api-db-v15.azurerm_postgresql_flexible_server.pgsql_server will be destroyed
  # (because azurerm_postgresql_flexible_server.pgsql_server is not in configuration)
  - resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      - administrator_login           = "pgadmin" -> null
      - administrator_password        = (sensitive value)
      - backup_retention_days         = 35 -> null
      - create_mode                   = "Default" -> null
      - delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgres-expanded" -> null
      - fqdn                          = "ia-case-api-postgres-db-v15-aat.postgres.database.azure.com" -> null
      - geo_redundant_backup_enabled  = false -> null
      - id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-case-api-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ia-case-api-postgres-db-v15-aat" -> null
      - location                      = "uksouth" -> null
      - name                          = "ia-case-api-postgres-db-v15-aat" -> null
      - private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com" -> null
      - public_network_access_enabled = false -> null
      - replication_role              = "" -> null
      - resource_group_name           = "ia-case-api-postgres-db-v15-data-aat" -> null
      - sku_name                      = "GP_Standard_D2s_v3" -> null
      - storage_mb                    = 65536 -> null
      - tags                          = {
          - "application"         = "immigration"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/ia-case-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ia-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-12-19T11:30:57Z"
          - "managedBy"           = "Immigration"
        } -> null
      - version                       = "15" -> null
      - zone                          = "2" -> null

      - authentication {
          - active_directory_auth_enabled = true -> null
          - password_auth_enabled         = true -> null
          - tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        }

      - high_availability {
          - mode                      = "ZoneRedundant" -> null
          - standby_availability_zone = "1" -> null
        }

      - maintenance_window {
          - day_of_week  = 0 -> null
          - start_hour   = 3 -> null
          - start_minute = 0 -> null
        }
    }

  # module.ia-case-api-db-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be destroyed
  # (because azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin is not in configuration)
  - resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-case-api-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ia-case-api-postgres-db-v15-aat/administrators/e7ea2042-4ced-45dd-8ae3-e051c6551789" -> null
      - object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> null
      - principal_name      = "DTS Platform Operations" -> null
      - principal_type      = "Group" -> null
      - resource_group_name = "ia-case-api-postgres-db-v15-data-aat" -> null
      - server_name         = "ia-case-api-postgres-db-v15-aat" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.ia-case-api-db-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be destroyed
  # (because azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin is not in configuration)
  - resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-case-api-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ia-case-api-postgres-db-v15-aat/administrators/ca6d5085-485a-417d-8480-c3cefa29df31" -> null
      - object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31" -> null
      - principal_name      = "jenkins-cftptl-intsvc-mi" -> null
      - principal_type      = "ServicePrincipal" -> null
      - resource_group_name = "ia-case-api-postgres-db-v15-data-aat" -> null
      - server_name         = "ia-case-api-postgres-db-v15-aat" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.ia-case-api-db-v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] will be destroyed
  # (because azurerm_postgresql_flexible_server_configuration.pgsql_server_config is not in configuration)
  - resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      - id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-case-api-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ia-case-api-postgres-db-v15-aat/configurations/azure.extensions" -> null
      - name      = "azure.extensions" -> null
      - server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-case-api-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ia-case-api-postgres-db-v15-aat" -> null
      - value     = "plpgsql,pg_stat_statements,pg_buffercache" -> null
    }

  # module.ia-case-api-db-v15.azurerm_postgresql_flexible_server_database.pg_databases["ia_case_api"] will be destroyed
  # (because azurerm_postgresql_flexible_server_database.pg_databases is not in configuration)
  - resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      - charset   = "UTF8" -> null
      - collation = "en_GB.utf8" -> null
      - id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-case-api-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ia-case-api-postgres-db-v15-aat/databases/ia_case_api" -> null
      - name      = "ia_case_api" -> null
      - server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-case-api-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ia-case-api-postgres-db-v15-aat" -> null
    }

  # module.ia-case-api-db-v15.azurerm_resource_group.rg[0] will be destroyed
  # (because azurerm_resource_group.rg is not in configuration)
  - resource "azurerm_resource_group" "rg" {
      - id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-case-api-postgres-db-v15-data-aat" -> null
      - location = "uksouth" -> null
      - name     = "ia-case-api-postgres-db-v15-data-aat" -> null
      - tags     = {
          - "application"         = "immigration"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/ia-case-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ia-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-12-19T11:30:57Z"
          - "managedBy"           = "Immigration"
        } -> null
    }

  # module.ia-case-api-db-v15.null_resource.set-user-permissions-additionaldbs["ia_case_api"] will be destroyed
  # (because null_resource.set-user-permissions-additionaldbs is not in configuration)
  - resource "null_resource" "set-user-permissions-additionaldbs" {
      - id       = "7461100482418091043" -> null
      - triggers = {
          - "db_reader_user" = "DTS CFT DB Access Reader"
          - "force_trigger"  = "1"
          - "name"           = "ia-case-api-postgres-db-v15"
          - "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        } -> null
    }

  # module.ia-case-api-db-v15.random_password.password will be destroyed
  # (because random_password.password is not in configuration)
  - resource "random_password" "password" {
      - bcrypt_hash      = (sensitive value)
      - id               = "none" -> null
      - length           = 20 -> null
      - lower            = true -> null
      - min_lower        = 0 -> null
      - min_numeric      = 0 -> null
      - min_special      = 0 -> null
      - min_upper        = 0 -> null
      - number           = true -> null
      - numeric          = true -> null
      - override_special = "()-_" -> null
      - result           = (sensitive value)
      - special          = true -> null
      - upper            = true -> null
    }

  # module.ia_case_api_database_11.data.azurerm_postgresql_server.replica will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_postgresql_server" "replica" {
      + administrator_login = (known after apply)
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + identity            = (known after apply)
      + location            = (known after apply)
      + name                = "ia-case-api-postgres-11-db-aat"
      + resource_group_name = "ia-case-api-postgres-11-db-data-aat"
      + sku_name            = (known after apply)
      + tags                = (known after apply)
      + version             = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.ia_case_api_database_11.azurerm_resource_group.data-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "data-resourcegroup" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-case-api-postgres-11-db-data-aat"
        name     = "ia-case-api-postgres-11-db-data-aat"
      ~ tags     = {
          - "application"         = "immigration"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/ia-case-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ia-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-12-19T11:30:57Z"
          - "managedBy"           = "Immigration"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.ia_case_api_database_11.azurerm_template_deployment.postgres-paas will be updated in-place
  ~ resource "azurerm_template_deployment" "postgres-paas" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-case-api-postgres-11-db-data-aat/providers/Microsoft.Resources/deployments/ia-case-api-postgres-11-db-aat"
        name                = "ia-case-api-postgres-11-db-aat"
      ~ parameters          = {
          - "administratorLogin"         = "ia_case_api"
          - "administratorLoginPassword" = "nL?:UK:$YdF{<I$%"
          - "backupRetentionDays"        = "7"
          - "charset"                    = "utf8"
          - "collation"                  = "en-GB"
          - "commonTags"                 = "eyJhcHBsaWNhdGlvbiI6ImltbWlncmF0aW9uIiwiYXV0b1NodXRkb3duIjoidHJ1ZSIsImJ1aWx0RnJvbSI6Imh0dHBzOi8vZ2l0aHViLmNvbS9ITUNUUy9pYS1jYXNlLWFwaS5naXQiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2lhLXRlY2giLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJsYXN0VXBkYXRlZCI6IjIwMjMtMTItMTlUMTE6MzA6NTdaIiwibWFuYWdlZEJ5IjoiSW1taWdyYXRpb24ifQ=="
          - "dbName"                     = "ia_case_api"
          - "dbRules"                    = "W3sicnVsZV9uYW1lIjoiY2Z0YWtzLXRmLWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvOTZjMjc0Y2UtODQ2ZC00ZTQ4LTg5YTctZDUyODQzMjI5OGE3L3Jlc291cmNlR3JvdXBzL2NmdC1hYXQtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1hYXQtdm5ldC9zdWJuZXRzL2Frcy0wMCJ9LHsicnVsZV9uYW1lIjoiY2Z0YWtzLXRmLWFrczAxIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvOTZjMjc0Y2UtODQ2ZC00ZTQ4LTg5YTctZDUyODQzMjI5OGE3L3Jlc291cmNlR3JvdXBzL2NmdC1hYXQtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1hYXQtdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiYXNlIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvMWM0ZjA3MDQtYTI5ZS00MDNkLWI3MTktYjkwYzM0ZWYxNGM5L3Jlc291cmNlR3JvdXBzL2NvcmUtaW5mcmEtYWF0L3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY29yZS1pbmZyYS12bmV0LWFhdC9zdWJuZXRzL2NvcmUtaW5mcmEtc3VibmV0LTMtYWF0In0seyJydWxlX25hbWUiOiJha3MiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYzRmMDcwNC1hMjllLTQwM2QtYjcxOS1iOTBjMzRlZjE0YzkvcmVzb3VyY2VHcm91cHMvY29yZS1pbmZyYS1hYXQvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jb3JlLWluZnJhLXZuZXQtYWF0L3N1Ym5ldHMvYWtzIn0seyJydWxlX25hbWUiOiJqZW5raW5zLWFrcyIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFiYWY1NDcwLTFjM2UtNDBkMy1hNmY3LTc0YmZiY2U0YjM0OC9yZXNvdXJjZUdyb3Vwcy9jZnQtcHRsLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jZnQtcHRsLXZuZXQvc3VibmV0cy9pYWFzIn0seyJydWxlX25hbWUiOiJqZW5raW5zLWFrcy1hZ2VudCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFiYWY1NDcwLTFjM2UtNDBkMy1hNmY3LTc0YmZiY2U0YjM0OC9yZXNvdXJjZUdyb3Vwcy9jZnQtcHRsLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jZnQtcHRsLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1zZXJ2aWNlcy10ZXN0LWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvM2VlYzViZGUtN2ZlYi00NTY2LWJmYjYtODA1ZGY2ZTEwYjkwL3Jlc291cmNlR3JvdXBzL3NzLXRlc3QtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL3NzLXRlc3Qtdm5ldC9zdWJuZXRzL2Frcy0wMCJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLXRlc3QtYWtzMDEiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8zZWVjNWJkZS03ZmViLTQ1NjYtYmZiNi04MDVkZjZlMTBiOTAvcmVzb3VyY2VHcm91cHMvc3MtdGVzdC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtdGVzdC12bmV0L3N1Ym5ldHMvYWtzLTAxIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtc3RnLWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvNzRkYWNkNGYtYTI0OC00NWJiLWEyZjAtYWY3MDBkYzRjZjY4L3Jlc291cmNlR3JvdXBzL3NzLXN0Zy1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3Mtc3RnLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1zZXJ2aWNlcy1zdGctYWtzMDEiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy83NGRhY2Q0Zi1hMjQ4LTQ1YmItYTJmMC1hZjcwMGRjNGNmNjgvcmVzb3VyY2VHcm91cHMvc3Mtc3RnLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9zcy1zdGctdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiYmFzdGlvbi1ub25wcm9kLXZuZXQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy9iNDRlYjQ3OS05YWUyLTQyZTctOWM2My1mM2M1OTk3MTliNmYvcmVzb3VyY2VHcm91cHMvYmFzdGlvbi1ub25wcm9kLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvYmFzdGlvbi1ub25wcm9kLXZuZXQvc3VibmV0cy9iYXN0aW9uIn0seyJydWxlX25hbWUiOiJpZGFtLWFhdDItdm5ldCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFjNGYwNzA0LWEyOWUtNDAzZC1iNzE5LWI5MGMzNGVmMTRjOS9yZXNvdXJjZUdyb3Vwcy9jb3JlLWluZnJhLWlkYW0tYWF0Mi9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NvcmUtaW5mcmEtdm5ldC1pZGFtLWFhdDIvc3VibmV0cy9jb3JlLWluZnJhLXN1Ym5ldC03LWlkYW0tYWF0MiJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLWRldi1ha3MwMCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzg2N2E4NzhiLWNiNjgtNGRlNS05NzQxLTM2MWFjOWUxNzhiNi9yZXNvdXJjZUdyb3Vwcy9zcy1kZXYtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL3NzLWRldi12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtZGV2LWFrczAxIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvODY3YTg3OGItY2I2OC00ZGU1LTk3NDEtMzYxYWM5ZTE3OGI2L3Jlc291cmNlR3JvdXBzL3NzLWRldi1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtZGV2LXZuZXQvc3VibmV0cy9ha3MtMDEifV0="
          - "env"                        = "aat"
          - "geoRedundantBackup"         = "Enabled"
          - "location"                   = "UK South"
          - "serverName"                 = "ia-case-api-postgres-11-db-aat"
          - "skuCapacity"                = "2"
          - "skuName"                    = "GP_Gen5_2"
          - "skuSizeMB"                  = "51200"
          - "skuTier"                    = "GeneralPurpose"
          - "sslEnforcement"             = "Enabled"
          - "version"                    = "11"
        } -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 9 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1872,"Program":"tfcmt","SHA1":"","Vars":{}} -->